# Naive Bayes Classifier
it uses bayes theorem for __conditional probability__ with naive assumption that the features are not correlated to each other and tries to find conditional probabilty of target variable given the probabilities of features.<br>
*__here we are going to find the probability of titanic survival based on Sex, Class, Age, Cabin and Fare.__
###### P(Survived/(Sex&Class&Age&Cabin&Fare))
*The __reason__ it's called __Naive__ it is because we make __naive assumption__ that features such as male, class, age, fare etc are __independent of each other__ but in reality __fare is related to the cabin__. But the assumption is there to make the algorithm simple and effective.*<br>
__USES__<br>
Naive bayes is used in __email spam detection, hand written digit detection, weather prediction, face detection and news article categorization__

In [14]:
import pandas as pd
df = pd.read_csv(r"data\titanic.csv")
df.head(10)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
5,6,"Moran, Mr. James",3,male,NaN,0,0,330877,8.4583,NaN,Q,0
6,7,"McCarthy, Mr. Timothy J",1,male,54.0,0,0,17463,51.8625,E46,S,0
7,8,"Palsson, Master. Gosta Leonard",3,male,2.0,3,1,349909,21.0750,NaN,S,0
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",3,female,27.0,0,2,347742,11.1333,NaN,S,1
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",2,female,14.0,1,0,237736,30.0708,NaN,C,1

In [15]:
# Some data cleaning/exploration
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns', inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [17]:
# specifying the X(inputs/independent variables) and the Y(target/dependent variable)
target = df.Survived
inputs = df.drop('Survived',axis='columns')

In [21]:
# machine model can't handle text so we convert sex to number
dummies = pd.get_dummies(inputs.Sex)
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [22]:
# checking if there's any NaN values in the columns
inputs.columns[inputs.isna().any()]              # we get Age column has some Na values

Index(['Age'], dtype='object')

In [23]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [24]:
# filling the Na with the mean
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [26]:
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [27]:
# splitting our dataset into train and test
from sklearn.model_selection import train_test_split
x = inputs
y = target
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.3)

In [28]:
# training the model
from sklearn.naive_bayes import GaussianNB
# You use Gaussian Naive Bayes when your data distribution is normal or like a Gaussian Distribution
model = GaussianNB()
model.fit(x_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [29]:
model.score(x_test,y_test)

0.7910447761194029

In [30]:
x_test[:10]

     Pclass        Age      Fare  female  male
40        3  40.000000    9.4750       1     0
607       1  27.000000   30.5000       0     1
17        2  29.699118   13.0000       0     1
747       2  30.000000   13.0000       1     0
821       3  27.000000    8.6625       0     1
369       1  24.000000   69.3000       1     0
581       1  39.000000  110.8833       1     0
110       1  47.000000   52.0000       0     1
757       2  18.000000   11.5000       0     1
317       2  54.000000   14.0000       0     1

In [31]:
y_test[:10]

40     0
607    1
17     1
747    1
821    1
369    1
581    1
110    0
757    0
317    0
Name: Survived, dtype: int64

In [32]:
# predicting
model.predict(x_test[:10])

array([1, 0, 0, 1, 0, 1, 1, 0, 0, 0], dtype=int64)

In [34]:
model.predict([[1,80,110,0,1]])

array([1], dtype=int64)

In [36]:
# predict_proba() to figure out probability of each class. in this case classes are weather person servives or not surved
model.predict_proba(x_test[:10])

array([[9.13638226e-02, 9.08636177e-01],
       [9.09384683e-01, 9.06153174e-02],
       [9.75902214e-01, 2.40977861e-02],
       [3.97970467e-02, 9.60202953e-01],
       [9.88585824e-01, 1.14141761e-02],
       [3.85718585e-03, 9.96142814e-01],
       [6.12255473e-04, 9.99387745e-01],
       [8.84528939e-01, 1.15471061e-01],
       [9.69554450e-01, 3.04455498e-02],
       [9.76271143e-01, 2.37288574e-02]])